MySpooks-Backend/app/controllers/monsters_controller.rb

SELECT "monsters".* FROM "monsters"
---
  def index
    render json: Monster.all

SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Monster.find(params[:id])

INSERT INTO "monsters" ("name", "img_url", "spook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "EVIL SNICKERS"], ["img_url", "klsajdklasj"], ["spook_id", 8], ["created_at", "2018-10-22 21:27:27.384712"], ["updated_at", "2018-10-22 21:27:27.384712"]]
---
  def create
    render json: Monster.create(monster_params)

SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "monsters".* FROM "monsters"
SELECT "monster_fears".* FROM "monster_fears" WHERE "monster_fears"."monster_id" = $1  [["monster_id", 9]]
DELETE FROM "monsters" WHERE "monsters"."id" = $1  [["id", 9]]
SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def destroy
    deleted_monster = Monster.find(params[:id])
    deleted_monster.monster_fears.each do |fear|
      fear.destroy
    end
    render json: Monster.find(params[:id]).destroy

INSERT INTO "spooks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2018-10-25 15:41:35.572700"], ["updated_at", "2018-10-25 15:41:35.572700"]]
SELECT  "spooks".* FROM "spooks" WHERE "spooks"."name" = $1 LIMIT $2  [["name", "test"], ["LIMIT", 1]]
SELECT  "monster_fears".* FROM "monster_fears" WHERE "monster_fears"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "monster_fears".* FROM "monster_fears"
INSERT INTO "monsters" ("name", "img_url", "spook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Baby"], ["img_url", "src/profile.jpg"], ["spook_id", 10], ["created_at", "2018-10-25 15:41:35.611206"], ["updated_at", "2018-10-25 15:41:35.611206"]]
INSERT INTO "monster_fears" ("monster_id", "spook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["monster_id", 11], ["spook_id", 1], ["created_at", "2018-10-25 15:41:35.634870"], ["updated_at", "2018-10-25 15:41:35.634870"]]
INSERT INTO "monster_fears" ("monster_id", "spook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["monster_id", 11], ["spook_id", 10], ["created_at", "2018-10-25 15:41:35.646055"], ["updated_at", "2018-10-25 15:41:35.646055"]]
---
  def create_entire_monster
    # pull monster params
    new_name = params[:name]
    new_img_url = params[:img_url]
    # pull spook params
    spook_id = Spook.find_or_create_by(name: params[:spook]).id
    # pull monster_fear params
    monster_fear_id = MonsterFear.find(params[:fear]).id
    rand_fear_id = MonsterFear.all.sample.id
    fear_array = [monster_fear_id, rand_fear_id]

    # byebug
    new_monst = Monster.create(name: new_name, img_url: new_img_url, spook_id: spook_id)

    monster_id = new_monst.id
    mf1 = MonsterFear.create(monster_id: monster_id, spook_id: monster_fear_id)
    mf2 = MonsterFear.create(monster_id: monster_id, spook_id: rand_fear_id)