MySpooks-Backend/app/controllers/monster_fears_controller.rb

  def index
  render json: MonsterFear.all
---
SELECT "monster_fears".* FROM "monster_fears"

  def create
    render json: MonsterFear.create(monster_fear_params)
---
INSERT INTO "monster_fears" ("monster_id", "spook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["monster_id", 26], ["spook_id", 4], ["created_at", "2018-10-23 13:53:09.253193"], ["updated_at", "2018-10-23 13:53:09.253193"]]

  def destroy
    render json: MonsterFear.find(params[:id]).destroy
---
DELETE FROM "monsters" WHERE "monsters"."id" = $1  [["id", 19]]
DELETE FROM "monster_fears" WHERE "monster_fears"."id" = $1  [["id", 1]]
SELECT  "monster_fears".* FROM "monster_fears" WHERE "monster_fears"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]