MySpooks-Backend/app/controllers/spooks_controller.rb

  def index
    render json: Spook.all
---
SELECT "spooks".* FROM "spooks"

  def show
    render json: Spook.find(params[:id])
---
SELECT  "spooks".* FROM "spooks" WHERE "spooks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
      render json: Spook.create(spook_params)
---
INSERT INTO "spooks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Popping out"], ["created_at", "2018-10-22 21:17:57.736119"], ["updated_at", "2018-10-22 21:17:57.736119"]]

  def destroy
    render json: Spook.find(params[:id]).destroy
---
DELETE FROM "spooks" WHERE "spooks"."id" = $1  [["id", 28]]
SELECT  "spooks".* FROM "spooks" WHERE "spooks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]